In [2]:
#head
#tail
#describe
#isNa
#Shape
#dtypes
#index


#columns

In [3]:
import pandas as pd

In [4]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = 'db08276bc116c438d3fdee492026f8223584c477'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.1.3

FILE
    /home/user/Downloads/ENTER/lib/python3.8/site-packages/pandas/__init__.py

In [5]:
data=pd.read_csv("/home/user/Documents/Class Recordings/Artifical Intelligence_Jan Batch/ML/adult.csv")
data

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [6]:
data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [7]:
data.tail()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [8]:
data.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [9]:
data.shape

(48842, 15)

In [10]:
data.describe

<bound method NDFrame.describe of        age     workclass  fnlwgt     education  educational-num  \
0       25       Private  226802          11th                7
1       38       Private   89814       HS-grad                9
2       28     Local-gov  336951    Assoc-acdm               12
3       44       Private  160323  Some-college               10
4       18             ?  103497  Some-college               10
...    ...           ...     ...           ...              ...
48837   27       Private  257302    Assoc-acdm               12
48838   40       Private  154374       HS-grad                9
48839   58       Private  151910       HS-grad                9
48840   22       Private  201490       HS-grad                9
48841   52  Self-emp-inc  287927       HS-grad                9

           marital-status         occupation relationship   race  gender  \
0           Never-married  Machine-op-inspct    Own-child  Black    Male
1      Married-civ-spouse    Farming-fishing      Husband  White    Male
2      Married-civ-spouse    Protective-serv      Husband  White    Male
3      Married-civ-spouse  Machine-op-inspct      Husband  Black    Male
4           Never-married                  ?    Own-child  White  Female
...                   ...                ...          ...    ...     ...
48837  Married-civ-spouse       Tech-support         Wife  White  Female
48838  Married-civ-spouse  Machine-op-inspct      Husband  White    Male
48839             Widowed       Adm-clerical    Unmarried  White  Female
48840       Never-married       Adm-clerical    Own-child  White    Male
48841  Married-civ-spouse    Exec-managerial         Wife  White  Female

       capital-gain  capital-loss  hours-per-week native-country income
0                 0             0              40  United-States  <=50K
1                 0             0              50  United-States  <=50K
2                 0             0              40  United-States   >50K
3              7688             0              40  United-States   >50K
4                 0             0              30  United-States  <=50K
...             ...           ...             ...            ...    ...
48837             0             0              38  United-States  <=50K
48838             0             0              40  United-States   >50K
48839             0             0              40  United-States  <=50K
48840             0             0              20  United-States  <=50K
48841         15024             0              40  United-States   >50K

[48842 rows x 15 columns]>

# Creating a Series

In [11]:
s=pd.Series([3,4,5,67,5]) #1 dimensional,no columns 
type(s)

pandas.core.series.Series

# Creating Data frame

In [12]:
d=pd.DataFrame([2,4,6,7,8,9])
type(d)

pandas.core.frame.DataFrame

In [13]:
s.shape  #series is 1 dimensional,no columns

(5,)

In [14]:
d.shape #dataframe is 2 dimensional. it has rows and columns

(6, 1)

In [15]:
d

   0
0  2
1  4
2  6
3  7
4  8
5  9

In [16]:
s

0     3
1     4
2     5
3    67
4     5
dtype: int64

In [17]:
s.describe()  #Numerical coulumn's mean,media

count     5.0000
mean     16.8000
std      28.0749
min       3.0000
25%       4.0000
50%       5.0000
75%       5.0000
max      67.0000
dtype: float64

In [18]:
s1=pd.Series([123,"nitha",55.5])
s1

0      123
1    nitha
2     55.5
dtype: object

In [19]:
s1.dtypes   # o for object

dtype('O')

In [20]:
s1=pd.Series([123,"nitha",55.5])
s1

0      123
1    nitha
2     55.5
dtype: object

In [21]:
s2=pd.Series([23,56.7,44.7])
s2

0    23.0
1    56.7
2    44.7
dtype: float64

In [22]:
s2.dtype

dtype('float64')

In [23]:
student_list=[["nitha",23,67,78,89],["jitha",23,67,98,89],["mitha",23,77,78,89]]
student_list

[['nitha', 23, 67, 78, 89],
 ['jitha', 23, 67, 98, 89],
 ['mitha', 23, 77, 78, 89]]

In [24]:
len(student_list)

3

In [25]:
type(student_list)

list

In [26]:
df=pd.DataFrame(student_list)  # created data frame with student list
df

       0   1   2   3   4
0  nitha  23  67  78  89
1  jitha  23  67  98  89
2  mitha  23  77  78  89

In [27]:
df.index   #row index , we have 3 rows ,0th row,1st row,2 nd row

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.columns  #column index

RangeIndex(start=0, stop=5, step=1)

In [29]:
df=pd.DataFrame(student_list,columns=['Name','Age','sub1','sub2','sub3'])
df

    Name  Age  sub1  sub2  sub3
0  nitha   23    67    78    89
1  jitha   23    67    98    89
2  mitha   23    77    78    89

In [30]:
type(df.columns)

pandas.core.indexes.base.Index

In [31]:
df.columns=['Name','Age','subject1','subject2','subject3']  #changing the column names. we have to assign 
#full coulmn list again to change 1 column name. we are over writing. not able to update a single column
df

    Name  Age  subject1  subject2  subject3
0  nitha   23        67        78        89
1  jitha   23        67        98        89
2  mitha   23        77        78        89

In [32]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [33]:
gender=["m","f","m"]

In [34]:
df["Gender"]=gender  # Adding
df

    Name  Age  subject1  subject2  subject3 Gender
0  nitha   23        67        78        89      m
1  jitha   23        67        98        89      f
2  mitha   23        77        78        89      m

In [35]:
df.describe() # only numeric columns's mean, median,mode... info are showing

        Age   subject1   subject2  subject3
count   3.0   3.000000   3.000000       3.0
mean   23.0  70.333333  84.666667      89.0
std     0.0   5.773503  11.547005       0.0
min    23.0  67.000000  78.000000      89.0
25%    23.0  67.000000  78.000000      89.0
50%    23.0  67.000000  78.000000      89.0
75%    23.0  72.000000  88.000000      89.0
max    23.0  77.000000  98.000000      89.0

In [36]:
df.describe(include='O') # object column gender is showing

         Name Gender
count       3      3
unique      3      2
top     nitha      m
freq        1      2

# # Access Data from DataFrame

In [37]:
df['Name'] #or we can df.Name

0    nitha
1    jitha
2    mitha
Name: Name, dtype: object

In [38]:
df[['Name','Age','subject1','subject2','subject3']]

    Name  Age  subject1  subject2  subject3
0  nitha   23        67        78        89
1  jitha   23        67        98        89
2  mitha   23        77        78        89

#Loc Function to access particular data

In [39]:

#to access a column

df['Name']

0    nitha
1    jitha
2    mitha
Name: Name, dtype: object